In [2]:
#imports
import pandas as pd
import seaborn as sns

In [28]:
Education_data = pd.read_csv("Education_attainment.csv")
Education_data.columns

Index(['Year', 'Sex', 'Min degree', 'total', 'White', 'Black', 'Hispanic',
       'Asian', 'Pacific Islander', 'American Indian/Alaska Native',
       'Two or more races'],
      dtype='object')

nunique() & unique()

In [15]:
Education_data["Year"].nunique()

24

Value_Counts()

In [18]:
Education_data["Min degree"].value_counts()

high school    59
bachelor's     59
associate's    48
master's       48
Name: Min degree, dtype: int64

Filtering

In [19]:
Filtered_data = Education_data.filter(items=["Year", "Min degree"])

In [20]:
Filtered_data

       Year   Min degree
0    1920.0  high school
1    1940.0  high school
2    1950.0  high school
3    1960.0  high school
4    1970.0  high school
..      ...          ...
211  2016.0     master's
212  2017.0     master's
213  2018.0     master's
214     NaN          NaN
215     6.0          NaN

[216 rows x 2 columns]

filtering by raw

In [24]:
Education_data.filter(like='211', axis=0)

,Year,Sex,Min degree,total,White,Black,Hispanic,Asian,Pacific Islander,American Indian/Alaska Native,Two or more races
211,2016.0,F,master's,11.2,12.3,6.3,6.3,28.8,---,---,8.2

groupby() function

In [45]:
df_group = Education_data.groupby('Min degree')
# df_group.get_group("bachelor's")

isnull() & notnull()

In [35]:
pd.isnull(Education_data["Year"])

0      False
1      False
2      False
3      False
4      False
       ...
211    False
212    False
213    False
214     True
215    False
Name: Year, Length: 216, dtype: bool

In [36]:
pd.notnull(Education_data["Year"])

0       True
1       True
2       True
3       True
4       True
       ...
211     True
212     True
213     True
214    False
215     True
Name: Year, Length: 216, dtype: bool

rename() function

In [47]:
new_data = Education_data.rename(columns={"Sex": "Gender"})

In [49]:
Education_data.mean()

C:\Users\jaycee\AppData\Local\Temp\ipykernel_17132\2497527471.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  Education_data.mean()

Year     1996.176744
White      47.210280
Black      35.188318
dtype: float64